# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11x object detection model with BiFPN only (Ablation Study)
# For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1 # number of classes (will be overridden by dataset yaml)
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: lightweight version
  s: [0.50, 0.50, 1024] # summary: small version
  m: [0.50, 1.00, 512]  # summary: medium version
  l: [1.00, 1.00, 512]  # summary: large version
  x: [1.00, 1.50, 512]  # summary: extra large version

# Standard YOLO11x backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11x head with BiFPN only
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 6], 1, BiFPN_Concat, [1]] # 12-cat backbone P4 with BiFPN
  - [-1, 2, C3k2, [512, False]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 4], 1, BiFPN_Concat, [1]] # 15-cat backbone P3 with BiFPN  
  - [-1, 2, C3k2, [256, False]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]] # 17
  - [[-1, 13], 1, BiFPN_Concat, [1]] # 18-cat head P4 with BiFPN
  - [-1, 2, C3k2, [512, False]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] # 20
  - [[-1, 10], 1, BiFPN_Concat, [1]] # 21-cat head P5 with BiFPN
  - [-1, 2, C3k2, [1024, True]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]] # 23-Detect(P3, P4, P5) 